###########################################################################
Network emergency mode:
leaf1  if-Et2 -> shutdown 
leaf3  if-Et1 -> shutdown 


leaf1#configure 
leaf1(config)#interface ethernet 2
leaf1(config-if-Et2)#shutdown 
leaf1(config-if-Et2)#show ip bgp summary
BGP summary information for VRF default
Router identifier 10.0.1.1, local AS number 65001
Neighbor Status Codes: m - Under maintenance
  Neighbor         V  AS           MsgRcvd   MsgSent  InQ OutQ  Up/Down State   PfxRcd PfxAcc
  10.2.1.11        4  65001           7707      7699    0    0 21:21:44 Estab   8      8
  10.2.1.13        4  65001           7696      7697    0    0 00:00:04 Active         
leaf1(config-if-Et2)#show ip route
 C        10.0.1.1/32 is directly connected, Loopback1
 B I      10.0.1.2/32 [200/0] via 10.2.1.11, Ethernet1
 B I      10.0.1.3/32 [200/0] via 10.2.1.11, Ethernet1
 B I      10.0.1.101/32 [200/0] via 10.2.1.11, Ethernet1
 B I      10.0.1.102/32 [200/0] via 10.2.1.11, Ethernet1
 C        10.2.1.10/31 is directly connected, Ethernet1
 B I      10.2.1.20/31 [200/0] via 10.2.1.11, Ethernet1
 B I      10.2.1.22/31 [200/0] via 10.2.1.11, Ethernet1
 B I      10.2.1.32/31 [200/0] via 10.2.1.11, Ethernet1
leaf1(config-if-Et2)#


leaf3#configure 
leaf3(config)#interface ethernet 1
leaf3(config-if-Et1)#shutdown 
leaf3(config-if-Et1)#show ip bgp summary
BGP summary information for VRF default
Router identifier 10.0.1.3, local AS number 65001
Neighbor Status Codes: m - Under maintenance
  Neighbor         V  AS           MsgRcvd   MsgSent  InQ OutQ  Up/Down State   PfxRcd PfxAcc
  10.2.1.31        4  65001           7694      7692    0    0 00:00:18 Active         
  10.2.1.33        4  65001           7703      7699    0    0 21:21:00 Estab   8      8
leaf3(config-if-Et1)#show ip route
 B I      10.0.1.1/32 [200/0] via 10.2.1.33, Ethernet2
 B I      10.0.1.2/32 [200/0] via 10.2.1.33, Ethernet2
 C        10.0.1.3/32 is directly connected, Loopback1
 B I      10.0.1.101/32 [200/0] via 10.2.1.33, Ethernet2
 B I      10.0.1.102/32 [200/0] via 10.2.1.33, Ethernet2
 B I      10.2.1.10/31 [200/0] via 10.2.1.33, Ethernet2
 B I      10.2.1.20/31 [200/0] via 10.2.1.33, Ethernet2
 B I      10.2.1.22/31 [200/0] via 10.2.1.33, Ethernet2
 C        10.2.1.32/31 is directly connected, Ethernet2
leaf3(config-if-Et1)#


leaf2#show ip bgp summary
BGP summary information for VRF default
Router identifier 10.0.1.2, local AS number 65001
Neighbor Status Codes: m - Under maintenance
  Neighbor         V  AS           MsgRcvd   MsgSent  InQ OutQ  Up/Down State   PfxRcd PfxAcc
  10.2.1.21        4  65001           7726      7720    0    0 21:25:08 Estab   4      4
  10.2.1.23        4  65001           7726      7720    0    0 21:24:30 Estab   4      4
leaf2#show ip route
 B I      10.0.1.1/32 [200/0] via 10.2.1.21, Ethernet1
 C        10.0.1.2/32 is directly connected, Loopback1
 B I      10.0.1.3/32 [200/0] via 10.2.1.23, Ethernet2
 B I      10.0.1.101/32 [200/0] via 10.2.1.21, Ethernet1
 B I      10.0.1.102/32 [200/0] via 10.2.1.23, Ethernet2
 B I      10.2.1.10/31 [200/0] via 10.2.1.21, Ethernet1
 C        10.2.1.20/31 is directly connected, Ethernet1
 C        10.2.1.22/31 is directly connected, Ethernet2
 B I      10.2.1.32/31 [200/0] via 10.2.1.23, Ethernet2
leaf2#