leaf1#show ip bgp summary
BGP summary information for VRF default
Router identifier 10.0.1.1, local AS number 65001
Neighbor Status Codes: m - Under maintenance
  Neighbor         V  AS           MsgRcvd   MsgSent  InQ OutQ  Up/Down State   PfxRcd PfxAcc
  10.2.1.11        4  65001            160       142    0    0 00:22:33 Estab   11     11
  10.2.1.13        4  65001          94796     94770    0    0    1d23h Estab   11     11
leaf1#

leaf2#show ip bgp summary
BGP summary information for VRF default
Router identifier 10.0.1.2, local AS number 65001
Neighbor Status Codes: m - Under maintenance
  Neighbor         V  AS           MsgRcvd   MsgSent  InQ OutQ  Up/Down State   PfxRcd PfxAcc
  10.2.1.21        4  65001          95086     95045    0    0    1d23h Estab   11     11
  10.2.1.23        4  65001          95088     95049    0    0    1d23h Estab   11     11
leaf2#

leaf3#show ip bgp summary
BGP summary information for VRF default
Router identifier 10.0.1.3, local AS number 65001
Neighbor Status Codes: m - Under maintenance
  Neighbor         V  AS           MsgRcvd   MsgSent  InQ OutQ  Up/Down State   PfxRcd PfxAcc
  10.2.1.31        4  65001          94774     94746    0    0    1d23h Estab   11     11
  10.2.1.33        4  65001          95079     95051    0    0    1d23h Estab   11     11
leaf3#

spine1#show ip bgp summary
BGP summary information for VRF default
Router identifier 10.0.1.101, local AS number 65001
Neighbor Status Codes: m - Under maintenance
  Neighbor         V  AS           MsgRcvd   MsgSent  InQ OutQ  Up/Down State   PfxRcd PfxAcc
  10.2.1.1         4  65001          17015     17017    0    0    1d23h Estab   8      8
  10.2.1.10        4  65001            143       161    0    0 00:22:42 Estab   1      1
  10.2.1.20        4  65001          16989     17019    0    0    1d23h Estab   1      1
  10.2.1.30        4  65001          16991     17019    0    0    1d23h Estab   1      1
spine1#


spine2#show ip bgp summary
BGP summary information for VRF default
Router identifier 10.0.1.102, local AS number 65001
Neighbor Status Codes: m - Under maintenance
  Neighbor         V  AS           MsgRcvd   MsgSent  InQ OutQ  Up/Down State   PfxRcd PfxAcc
  10.2.1.0         4  65001          17017     17015    0    0    1d23h Estab   8      8
  10.2.1.12        4  65001          16992     17021    0    0    1d23h Estab   1      1
  10.2.1.22        4  65001          16990     17022    0    0    1d23h Estab   1      1
  10.2.1.32        4  65001          16992     17020    0    0    1d23h Estab   1      1
spine2#

************************************************************************************************

leaf1#show ip route
 C        10.0.1.1/32 is directly connected, Loopback1
 B I      10.0.1.2/32 [200/0] via 10.2.1.11, Ethernet1
                              via 10.2.1.13, Ethernet2
 B I      10.0.1.3/32 [200/0] via 10.2.1.11, Ethernet1
                              via 10.2.1.13, Ethernet2
 B I      10.0.1.101/32 [200/0] via 10.2.1.11, Ethernet1
 B I      10.0.1.102/32 [200/0] via 10.2.1.13, Ethernet2
 C        10.1.1.1/32 is directly connected, Loopback2
 B I      10.2.1.0/31 [200/0] via 10.2.1.11, Ethernet1
                              via 10.2.1.13, Ethernet2
 C        10.2.1.10/31 is directly connected, Ethernet1
 C        10.2.1.12/31 is directly connected, Ethernet2
 B I      10.2.1.20/31 [200/0] via 10.2.1.11, Ethernet1
 B I      10.2.1.22/31 [200/0] via 10.2.1.13, Ethernet2
 B I      10.2.1.30/31 [200/0] via 10.2.1.11, Ethernet1
 B I      10.2.1.32/31 [200/0] via 10.2.1.13, Ethernet2
leaf1#

leaf2#show ip route
 B I      10.0.1.1/32 [200/0] via 10.2.1.21, Ethernet1
                              via 10.2.1.23, Ethernet2
 C        10.0.1.2/32 is directly connected, Loopback1
 B I      10.0.1.3/32 [200/0] via 10.2.1.21, Ethernet1
                              via 10.2.1.23, Ethernet2
 B I      10.0.1.101/32 [200/0] via 10.2.1.21, Ethernet1
 B I      10.0.1.102/32 [200/0] via 10.2.1.23, Ethernet2
 C        10.1.1.2/32 is directly connected, Loopback2
 B I      10.2.1.0/31 [200/0] via 10.2.1.21, Ethernet1
                              via 10.2.1.23, Ethernet2
 B I      10.2.1.10/31 [200/0] via 10.2.1.21, Ethernet1
 B I      10.2.1.12/31 [200/0] via 10.2.1.23, Ethernet2
 C        10.2.1.20/31 is directly connected, Ethernet1
 C        10.2.1.22/31 is directly connected, Ethernet2
 B I      10.2.1.30/31 [200/0] via 10.2.1.21, Ethernet1
 B I      10.2.1.32/31 [200/0] via 10.2.1.23, Ethernet2
leaf2#

leaf3#show ip route
 B I      10.0.1.1/32 [200/0] via 10.2.1.31, Ethernet1
                              via 10.2.1.33, Ethernet2
 B I      10.0.1.2/32 [200/0] via 10.2.1.31, Ethernet1
                              via 10.2.1.33, Ethernet2
 C        10.0.1.3/32 is directly connected, Loopback1
 B I      10.0.1.101/32 [200/0] via 10.2.1.31, Ethernet1
 B I      10.0.1.102/32 [200/0] via 10.2.1.33, Ethernet2
 C        10.1.1.3/32 is directly connected, Loopback2
 B I      10.2.1.0/31 [200/0] via 10.2.1.31, Ethernet1
                              via 10.2.1.33, Ethernet2
 B I      10.2.1.10/31 [200/0] via 10.2.1.31, Ethernet1
 B I      10.2.1.12/31 [200/0] via 10.2.1.33, Ethernet2
 B I      10.2.1.20/31 [200/0] via 10.2.1.31, Ethernet1
 B I      10.2.1.22/31 [200/0] via 10.2.1.33, Ethernet2
 C        10.2.1.30/31 is directly connected, Ethernet1
 C        10.2.1.32/31 is directly connected, Ethernet2
leaf3#


spine1#show ip route
 B I      10.0.1.1/32 [200/0] via 10.2.1.10, Ethernet1
 B I      10.0.1.2/32 [200/0] via 10.2.1.20, Ethernet2
 B I      10.0.1.3/32 [200/0] via 10.2.1.30, Ethernet3
 C        10.0.1.101/32 is directly connected, Loopback1
 B I      10.0.1.102/32 [200/0] via 10.2.1.1, Ethernet4
 C        10.2.1.0/31 is directly connected, Ethernet4
 C        10.2.1.10/31 is directly connected, Ethernet1
 B I      10.2.1.12/31 [200/0] via 10.2.1.1, Ethernet4
 C        10.2.1.20/31 is directly connected, Ethernet2
 B I      10.2.1.22/31 [200/0] via 10.2.1.1, Ethernet4
 C        10.2.1.30/31 is directly connected, Ethernet3
 B I      10.2.1.32/31 [200/0] via 10.2.1.1, Ethernet4
spine1#

spine2#show ip route
 B I      10.0.1.1/32 [200/0] via 10.2.1.12, Ethernet1
 B I      10.0.1.2/32 [200/0] via 10.2.1.22, Ethernet2
 B I      10.0.1.3/32 [200/0] via 10.2.1.32, Ethernet3
 B I      10.0.1.101/32 [200/0] via 10.2.1.0, Ethernet4
 C        10.0.1.102/32 is directly connected, Loopback1
 C        10.2.1.0/31 is directly connected, Ethernet4
 B I      10.2.1.10/31 [200/0] via 10.2.1.0, Ethernet4
 C        10.2.1.12/31 is directly connected, Ethernet1
 B I      10.2.1.20/31 [200/0] via 10.2.1.0, Ethernet4
 C        10.2.1.22/31 is directly connected, Ethernet2
 B I      10.2.1.30/31 [200/0] via 10.2.1.0, Ethernet4
 C        10.2.1.32/31 is directly connected, Ethernet3
spine2#

*************************************************************************

leaf1#configure 
leaf1(config)#interface ethernet 2
leaf1(config-if-Et2)#shutdown 

leaf1(config-if-Et2)#show ip route
 C        10.0.1.1/32 is directly connected, Loopback1
 B I      10.0.1.2/32 [200/0] via 10.2.1.11, Ethernet1
 B I      10.0.1.3/32 [200/0] via 10.2.1.11, Ethernet1
 B I      10.0.1.101/32 [200/0] via 10.2.1.11, Ethernet1
 B I      10.0.1.102/32 [200/0] via 10.2.1.11, Ethernet1
 C        10.1.1.1/32 is directly connected, Loopback2
 B I      10.2.1.0/31 [200/0] via 10.2.1.11, Ethernet1
 C        10.2.1.10/31 is directly connected, Ethernet1
 B I      10.2.1.20/31 [200/0] via 10.2.1.11, Ethernet1
 B I      10.2.1.22/31 [200/0] via 10.2.1.11, Ethernet1
 B I      10.2.1.32/31 [200/0] via 10.2.1.11, Ethernet1

leaf1(config-if-Et2)#show ip bgp summary
BGP summary information for VRF default
Router identifier 10.0.1.1, local AS number 65001
Neighbor Status Codes: m - Under maintenance
  Neighbor         V  AS           MsgRcvd   MsgSent  InQ OutQ  Up/Down State   PfxRcd PfxAcc
  10.2.1.11        4  65001            199       178    0    0 00:28:35 Estab   9      9
  10.2.1.13        4  65001          94831     94805    0    0 00:00:30 Active         
leaf1(config-if-Et2)#


leaf3#configure 
leaf3(config)#interface ethernet 1
leaf3(config-if-Et1)#shutdown 

leaf3(config-if-Et1)#show ip route
 B I      10.0.1.1/32 [200/0] via 10.2.1.33, Ethernet2
 B I      10.0.1.2/32 [200/0] via 10.2.1.33, Ethernet2
 C        10.0.1.3/32 is directly connected, Loopback1
 B I      10.0.1.101/32 [200/0] via 10.2.1.33, Ethernet2
 B I      10.0.1.102/32 [200/0] via 10.2.1.33, Ethernet2
 C        10.1.1.3/32 is directly connected, Loopback2
 B I      10.2.1.0/31 [200/0] via 10.2.1.33, Ethernet2
 B I      10.2.1.10/31 [200/0] via 10.2.1.33, Ethernet2
 B I      10.2.1.20/31 [200/0] via 10.2.1.33, Ethernet2
 B I      10.2.1.22/31 [200/0] via 10.2.1.33, Ethernet2
 C        10.2.1.32/31 is directly connected, Ethernet2

leaf3(config-if-Et1)#show ip bgp summary
BGP summary information for VRF default
Router identifier 10.0.1.3, local AS number 65001
Neighbor Status Codes: m - Under maintenance
  Neighbor         V  AS           MsgRcvd   MsgSent  InQ OutQ  Up/Down State   PfxRcd PfxAcc
  10.2.1.31        4  65001          94806     94779    0    0 00:00:21 Active         
  10.2.1.33        4  65001          95116     95085    0    0    1d23h Estab   9      9
leaf3(config-if-Et1)#

leaf3(config-if-Et1)#ping 10.0.1.1 source 10.0.1.3
PING 10.0.1.1 (10.0.1.1) from 10.0.1.3 : 72(100) bytes of data.
80 bytes from 10.0.1.1: icmp_seq=1 ttl=62 time=33.6 ms
80 bytes from 10.0.1.1: icmp_seq=2 ttl=62 time=29.6 ms
80 bytes from 10.0.1.1: icmp_seq=3 ttl=62 time=28.5 ms
80 bytes from 10.0.1.1: icmp_seq=4 ttl=62 time=34.1 ms
80 bytes from 10.0.1.1: icmp_seq=5 ttl=62 time=33.1 ms

--- 10.0.1.1 ping statistics ---
5 packets transmitted, 5 received, 0% packet loss, time 100ms
rtt min/avg/max/mdev = 28.570/31.827/34.101/2.269 ms, pipe 3, ipg/ewma 25.153/32.826 ms
leaf3(config-if-Et1)#ping 10.0.1.2 source 10.0.1.3  
PING 10.0.1.2 (10.0.1.2) from 10.0.1.3 : 72(100) bytes of data.
80 bytes from 10.0.1.2: icmp_seq=1 ttl=63 time=29.9 ms
80 bytes from 10.0.1.2: icmp_seq=2 ttl=63 time=24.6 ms
80 bytes from 10.0.1.2: icmp_seq=3 ttl=63 time=23.4 ms
80 bytes from 10.0.1.2: icmp_seq=4 ttl=63 time=27.5 ms
80 bytes from 10.0.1.2: icmp_seq=5 ttl=63 time=21.5 ms

--- 10.0.1.2 ping statistics ---
5 packets transmitted, 5 received, 0% packet loss, time 87ms
rtt min/avg/max/mdev = 21.590/25.455/29.960/2.974 ms, pipe 3, ipg/ewma 21.946/27.590 ms
leaf3(config-if-Et1)#